; domain
; This program has been derived and modified from the tool-kit at: 
; https://code.google.com/p/rip-planning-group/source/browse/trunk/project1/sokoban-domain.pddl?r=222 
; See LICENSE file at http://opensource.org/licenses/BSD-3-Clause for the New BSD license

(define (domain sokoban)

(:requirements :strips)

(:predicates 
		
		;Accessible location in Workspace
		(navigable ?l)
		
		;Direction of Movement
		(direction ?d)
		
		;Current location of the Block
		(block-at ?b ?l)
		
		;Current location of the Robot
		(robot-at ?l)
		
		;Selected Block
		(block ?b)
		
		;Location l1 and l2 are next to each other along the direction of Movement
		(adjacent ?l1 ?l2 ?d) 
		
		;Empty location in workspace
		(empty ?l)
	)

(:action move
	
	;Define Move Action
	;Requires from location, to location and direction of move
	;Requires from and to locations to be within workspace
	
	:parameters (?from ?to ?dirMove)
	
	:precondition (and
		
		(navigable ?from) 
		(navigable ?to) 
		(direction ?dirMove) 
		
		;Current location of the Robot as from location
		(robot-at ?from) 
		
		;Requires from and to locations to be next to each other along the direction of Movement
		(adjacent ?from ?to ?dirMove)
		
		;Requires to locations to be empty location in workspace 
		(empty ?to)
		
		)
	
	:effect (and 
		
		;Sets from locations to be empty location in workspace
		(empty ?from)
		
		;Sets Current location of the Robot as the to location in workspace
		(robot-at ?to) 
		
		;Updates to locations as not null, and sets from location as not the current location of the Robot in workspace
		(not (empty ?to))
		(not (robot-at ?from))
		)
	)

(:action push
	
	;Defines parameters for push operation that include robot location, selected block and its location
	;empty location to which the block has to be moved and the direction of the push operation
	
	:parameters (?robotLoc ?blockLoc ?freeLoc ?dirPush ?activeBlock)
	
	:precondition (and 
		
		;Requires robot location, selected block location and the empty location to be open in the workspace
		(navigable ?robotLoc) 
		(navigable ?blockLoc) 
		(navigable ?freeLoc) 
		
		;Initializing input variables
		(direction ?dirPush) 
		(block ?activeBlock) 
		(robot-at ?robotLoc) 
		
		;Initializing resultant variables
		(block-at ?activeBlock ?blockLoc) 
		(adjacent ?robotLoc ?blockLoc ?dirPush) 
		(adjacent ?blockLoc ?freeLoc ?dirPush) 
		(empty ?freeLoc)
		)
	
	:effect (and 
			
		;Sets robots new current location as the selected blocks old location
		(robot-at ?blockLoc)
		
		;Sets selected blocks new current location as the old null location 
		(block-at ?activeBlock ?freeLoc) 
		
		;Sets robots old location as null location
		(empty ?robotLoc) 
		
		;Updates the different locations as per effect of the move
		(not (robot-at ?robotLoc)) 
		(not (block-at ?activeBlock ?blockLoc)) 
		(not (empty ?freeLoc))
		)
	)

)

; problem
; This program has been derived and modified from the tool-kit at: 
; https://code.google.com/p/rip-planning-group/source/browse/trunk/project1/sokoban-domain.pddl?r=222 
; See LICENSE file at http://opensource.org/licenses/BSD-3-Clause for the New BSD license

(define (problem sokoban2)
 
	(:domain sokoban)
	
	(:objects 
		
		;Performs the following steps
		;Define valid directions
		;Define blocks in the problem world
		;Define the problem world co-ordinates

		up down left right 
		
		block1 block2
		
		X01-A X01-B X01-C X01-D X01-E X01-F X01-G X01-H
		X02-A X02-B X02-C X02-D X02-E X02-F X02-G X02-H
		X03-A X03-B X03-C X03-D X03-E X03-F X03-G X03-H
		X04-A X04-B X04-C X04-D X04-E X04-F X04-G X04-H
		X05-A X05-B X05-C X05-D X05-E X05-F X05-G X05-H
		X06-A X06-B X06-C X06-D X06-E X06-F X06-G X06-H
		
		)

	(:init 

		;Performs the following steps
		;Initialize different directions for use in domain
		;Initialize different blocks for use in domain
		;Initialize different open locations in the workspace for use in domain
		;Initialize different empty locations in the workspace for use in domain
		;Initialize the current location of the robot in the workspace for use in domain
		;Initialize the current location of the blocks in the workspace for use in domain
		;Initialize the adjacency matrix for the different cells in the workspace for use in domain
		
		(direction up)
		(direction down)
		(direction left) 
		(direction right)
		(block block1)
		(block block2)

		(navigable X02-G)
		(navigable X03-G)
		(navigable X04-G)
		(navigable X02-F)
		(navigable X03-F)
		(navigable X04-F)
		(navigable X05-F)
		(navigable X03-E)
		(navigable X04-E)
		(navigable X05-E)
		(navigable X04-D)
		(navigable X05-D)
		(navigable X05-C)
		(navigable X05-B)
		
		(empty X02-G)
		(empty X03-G)
		(empty X04-G)
		(empty X05-F)
		(empty X03-E)
		(empty X04-E)
		(empty X05-E)
		(empty X04-D)
		(empty X05-D)
		(empty X05-C)
		(empty X05-B)
		
		(robot-at X02-F)
		(block-at block1 X03-F)
		(block-at block2 X04-F)

		(adjacent X01-A X02-A right) (adjacent X01-A X01-B up)
		(adjacent X01-B X02-B right) (adjacent X01-B X01-A down) (adjacent X01-B X01-C up)
		(adjacent X01-C X02-C right) (adjacent X01-C X01-B down) (adjacent X01-C X01-D up)
		(adjacent X01-D X02-D right) (adjacent X01-D X01-C down) (adjacent X01-D X01-E up)
		(adjacent X01-E X02-E right) (adjacent X01-E X01-D down) (adjacent X01-E X01-F up)
		(adjacent X01-F X02-F right) (adjacent X01-F X01-E down) (adjacent X01-F X01-G up)
		(adjacent X01-G X02-G right) (adjacent X01-G X01-F down) (adjacent X01-G X01-H up)
		(adjacent X01-H X02-H right) (adjacent X01-H X01-G down)

		(adjacent X02-A X01-A left) (adjacent X02-A X03-A right) (adjacent X02-A X02-B up)
		(adjacent X02-B X01-B left) (adjacent X02-B X03-B right) (adjacent X02-B X02-A down) (adjacent X02-B X02-C up)
		(adjacent X02-C X01-C left) (adjacent X02-C X03-C right) (adjacent X02-C X02-B down) (adjacent X02-C X02-D up)
		(adjacent X02-D X01-D left) (adjacent X02-D X03-D right) (adjacent X02-D X02-C down) (adjacent X02-D X02-E up)
		(adjacent X02-E X01-E left) (adjacent X02-E X03-E right) (adjacent X02-E X02-D down) (adjacent X02-E X02-F up)
		(adjacent X02-F X01-F left) (adjacent X02-F X03-F right) (adjacent X02-F X02-E down) (adjacent X02-F X02-G up)
		(adjacent X02-G X01-G left) (adjacent X02-G X03-G right) (adjacent X02-G X02-F down) (adjacent X02-G X02-H up)
		(adjacent X02-H X01-H left) (adjacent X02-H X03-H right) (adjacent X02-H X02-G down)

		(adjacent X03-A X02-A left) (adjacent X03-A X04-A right) (adjacent X03-A X03-B up)
		(adjacent X03-B X02-B left) (adjacent X03-B X04-B right) (adjacent X03-B X03-A down) (adjacent X03-B X03-C up)
		(adjacent X03-C X02-C left) (adjacent X03-C X04-C right) (adjacent X03-C X03-B down) (adjacent X03-C X03-D up)
		(adjacent X03-D X02-D left) (adjacent X03-D X04-D right) (adjacent X03-D X03-C down) (adjacent X03-D X03-E up)
		(adjacent X03-E X02-E left) (adjacent X03-E X04-E right) (adjacent X03-E X03-D down) (adjacent X03-E X03-F up)
		(adjacent X03-F X02-F left) (adjacent X03-F X04-F right) (adjacent X03-F X03-E down) (adjacent X03-F X03-G up)
		(adjacent X03-G X02-G left) (adjacent X03-G X04-G right) (adjacent X03-G X03-F down) (adjacent X03-G X03-H up)
		(adjacent X03-H X02-H left) (adjacent X03-H X04-H right) (adjacent X03-H X03-G down)

		(adjacent X04-A X03-A left) (adjacent X04-A X05-A right) (adjacent X04-A X04-B up)
		(adjacent X04-B X03-B left) (adjacent X04-B X05-B right) (adjacent X04-B X04-A down) (adjacent X04-B X04-C up)
		(adjacent X04-C X03-C left) (adjacent X04-C X05-C right) (adjacent X04-C X04-B down) (adjacent X04-C X04-D up)
		(adjacent X04-D X03-D left) (adjacent X04-D X05-D right) (adjacent X04-D X04-C down) (adjacent X04-D X04-E up)
		(adjacent X04-E X03-E left) (adjacent X04-E X05-E right) (adjacent X04-E X04-D down) (adjacent X04-E X04-F up)
		(adjacent X04-F X03-F left) (adjacent X04-F X05-F right) (adjacent X04-F X04-E down) (adjacent X04-F X04-G up)
		(adjacent X04-G X03-G left) (adjacent X04-G X05-G right) (adjacent X04-G X04-F down) (adjacent X04-G X04-H up)
		(adjacent X04-H X03-H left) (adjacent X04-H X05-H right) (adjacent X04-H X04-G down)

		(adjacent X05-A X04-A left) (adjacent X05-A X06-A right) (adjacent X05-A X05-B up)
		(adjacent X05-B X04-B left) (adjacent X05-B X06-B right) (adjacent X05-B X05-A down) (adjacent X05-B X05-C up)
		(adjacent X05-C X04-C left) (adjacent X05-C X06-C right) (adjacent X05-C X05-B down) (adjacent X05-C X05-D up)
		(adjacent X05-D X04-D left) (adjacent X05-D X06-D right) (adjacent X05-D X05-C down) (adjacent X05-D X05-E up)
		(adjacent X05-E X04-E left) (adjacent X05-E X06-E right) (adjacent X05-E X05-D down) (adjacent X05-E X05-F up)
		(adjacent X05-F X04-F left) (adjacent X05-F X06-F right) (adjacent X05-F X05-E down) (adjacent X05-F X05-G up)
		(adjacent X05-G X04-G left) (adjacent X05-G X06-G right) (adjacent X05-G X05-F down) (adjacent X05-G X05-H up)
		(adjacent X05-H X04-H left) (adjacent X05-H X06-H right) (adjacent X05-H X05-G down)

		(adjacent X06-A X05-A left) (adjacent X06-A X06-B up)
		(adjacent X06-B X05-B left) (adjacent X06-B X06-A down) (adjacent X06-B X06-C up)
		(adjacent X06-C X05-C left) (adjacent X06-C X06-B down) (adjacent X06-C X06-D up)
		(adjacent X06-D X05-D left) (adjacent X06-D X06-C down) (adjacent X06-D X06-E up)
		(adjacent X06-E X05-E left) (adjacent X06-E X06-D down) (adjacent X06-E X06-F up)
		(adjacent X06-F X05-F left) (adjacent X06-F X06-E down) (adjacent X06-F X06-G up)
		(adjacent X06-G X05-G left) (adjacent X06-G X06-F down) (adjacent X06-G X06-H up)
		(adjacent X06-H X05-H left) (adjacent X06-H X06-G down)
	)

	(:goal
		
		;Performs the following steps
		;Define the final location of the blocks in the workspace as goal for the planners
		
		(and (block-at block1 X02-G) (block-at block2 X05-B) )
		
	)

)

; plan
1. (move x02-f x02-g up)
   deleted: (empty x02-g) (robot-at x02-f)
   added: (empty x02-f) (robot-at x02-g)
   goals met: 0 of 2
2. (move x02-g x03-g right)
   deleted: (empty x03-g) (robot-at x02-g)
   added: (empty x02-g) (robot-at x03-g)
   goals met: 0 of 2
3. (move x03-g x04-g right)
   deleted: (empty x04-g) (robot-at x03-g)
   added: (empty x03-g) (robot-at x04-g)
   goals met: 0 of 2
4. (push x04-g x04-f x04-e down block2)
   deleted: (robot-at x04-g) (block-at block2 x04-f) (empty x04-e)
   added: (robot-at x04-f) (block-at block2 x04-e) (empty x04-g)
   goals met: 0 of 2
5. (move x04-f x04-g up)
   deleted: (empty x04-g) (robot-at x04-f)
   added: (empty x04-f) (robot-at x04-g)
   goals met: 0 of 2
6. (move x04-g x03-g left)
   deleted: (empty x03-g) (robot-at x04-g)
   added: (empty x04-g) (robot-at x03-g)
   goals met: 0 of 2
7. (move x03-g x02-g left)
   deleted: (empty x02-g) (robot-at x03-g)
   added: (empty x03-g) (robot-at x02-g)
   goals met: 0 of 2
8. (move x02-g x02-f down)
   deleted: (empty x02-f) (robot-at x02-g)
   added: (empty x02-g) (robot-at x02-f)
   goals met: 0 of 2
9. (push x02-f x03-f x04-f right block1)
   deleted: (robot-at x02-f) (block-at block1 x03-f) (empty x04-f)
   added: (robot-at x03-f) (block-at block1 x04-f) (empty x02-f)
   goals met: 0 of 2
10. (move x03-f x03-e down)
   deleted: (empty x03-e) (robot-at x03-f)
   added: (empty x03-f) (robot-at x03-e)
   goals met: 0 of 2
11. (push x03-e x04-e x05-e right block2)
   deleted: (robot-at x03-e) (block-at block2 x04-e) (empty x05-e)
   added: (robot-at x04-e) (block-at block2 x05-e) (empty x03-e)
   goals met: 0 of 2
12. (move x04-e x03-e left)
   deleted: (empty x03-e) (robot-at x04-e)
   added: (empty x04-e) (robot-at x03-e)
   goals met: 0 of 2
13. (move x03-e x03-f up)
   deleted: (empty x03-f) (robot-at x03-e)
   added: (empty x03-e) (robot-at x03-f)
   goals met: 0 of 2
14. (move x03-f x03-g up)
   deleted: (empty x03-g) (robot-at x03-f)
   added: (empty x03-f) (robot-at x03-g)
   goals met: 0 of 2
15. (move x03-g x04-g right)
   deleted: (empty x04-g) (robot-at x03-g)
   added: (empty x03-g) (robot-at x04-g)
   goals met: 0 of 2
16. (push x04-g x04-f x04-e down block1)
   deleted: (robot-at x04-g) (block-at block1 x04-f) (empty x04-e)
   added: (robot-at x04-f) (block-at block1 x04-e) (empty x04-g)
   goals met: 0 of 2
17. (move x04-f x05-f right)
   deleted: (empty x05-f) (robot-at x04-f)
   added: (empty x04-f) (robot-at x05-f)
   goals met: 0 of 2
18. (push x05-f x05-e x05-d down block2)
   deleted: (robot-at x05-f) (block-at block2 x05-e) (empty x05-d)
   added: (robot-at x05-e) (block-at block2 x05-d) (empty x05-f)
   goals met: 0 of 2
19. (push x05-e x05-d x05-c down block2)
   deleted: (robot-at x05-e) (block-at block2 x05-d) (empty x05-c)
   added: (robot-at x05-d) (block-at block2 x05-c) (empty x05-e)
   goals met: 0 of 2
20. (push x05-d x05-c x05-b down block2)
   deleted: (robot-at x05-d) (block-at block2 x05-c) (empty x05-b)
   added: (robot-at x05-c) (block-at block2 x05-b) (empty x05-d)
   goals met: 1 of 2
21. (move x05-c x05-d up)
   deleted: (empty x05-d) (robot-at x05-c)
   added: (empty x05-c) (robot-at x05-d)
   goals met: 1 of 2
22. (move x05-d x04-d left)
   deleted: (empty x04-d) (robot-at x05-d)
   added: (empty x05-d) (robot-at x04-d)
   goals met: 1 of 2
23. (push x04-d x04-e x04-f up block1)
   deleted: (robot-at x04-d) (block-at block1 x04-e) (empty x04-f)
   added: (robot-at x04-e) (block-at block1 x04-f) (empty x04-d)
   goals met: 1 of 2
24. (move x04-e x05-e right)
   deleted: (empty x05-e) (robot-at x04-e)
   added: (empty x04-e) (robot-at x05-e)
   goals met: 1 of 2
25. (move x05-e x05-f up)
   deleted: (empty x05-f) (robot-at x05-e)
   added: (empty x05-e) (robot-at x05-f)
   goals met: 1 of 2
26. (push x05-f x04-f x03-f left block1)
   deleted: (robot-at x05-f) (block-at block1 x04-f) (empty x03-f)
   added: (robot-at x04-f) (block-at block1 x03-f) (empty x05-f)
   goals met: 1 of 2
27. (move x04-f x04-e down)
   deleted: (empty x04-e) (robot-at x04-f)
   added: (empty x04-f) (robot-at x04-e)
   goals met: 1 of 2
28. (move x04-e x03-e left)
   deleted: (empty x03-e) (robot-at x04-e)
   added: (empty x04-e) (robot-at x03-e)
   goals met: 1 of 2
29. (push x03-e x03-f x03-g up block1)
   deleted: (robot-at x03-e) (block-at block1 x03-f) (empty x03-g)
   added: (robot-at x03-f) (block-at block1 x03-g) (empty x03-e)
   goals met: 1 of 2
30. (move x03-f x04-f right)
   deleted: (empty x04-f) (robot-at x03-f)
   added: (empty x03-f) (robot-at x04-f)
   goals met: 1 of 2
31. (move x04-f x04-g up)
   deleted: (empty x04-g) (robot-at x04-f)
   added: (empty x04-f) (robot-at x04-g)
   goals met: 1 of 2
32. (push x04-g x03-g x02-g left block1)
   deleted: (robot-at x04-g) (block-at block1 x03-g) (empty x02-g)
   added: (robot-at x03-g) (block-at block1 x02-g) (empty x04-g)
   goals met: 2 of 2
